base/Catalogs/бит_НастройкиПротоколовРасхожденийБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_НастройкиПротоколовРасхожденийБюджета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСхемы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Comment>Бюджет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Comment>Периодичность</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьКодификаторСтатьи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Измерения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ресурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_НастройкиПротоколовРасхожденийБюджета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура инициализирует компоновщик, используемый для фильтрации структуры дерева.
// 
Функция ИнициализироватьКомпоновщик(вхТекстЗапроса, Компоновщик, УникальныйИдентификатор, Бюджет = Неопределено) Экспорт
	
	АдресКомпоновки = "";
	ТекстЗапроса = бит_МеханизмПолученияДанных.АдаптироватьТекстПостроителяДляКомпоновки(вхТекстЗапроса);
	
	СохраненныеОтборы  = Компоновщик.Настройки.Отбор.Элементы;
	СохраненныйПорядок = Компоновщик.Настройки.Порядок.Элементы;
	
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		
		// Создаем СКД по запросу
		СКД = бит_МеханизмПолученияДанных.СоздатьСхемуКомпоновкиПоЗапросу(ТекстЗапроса);
		Если ЗначениеЗаполнено(Бюджет) Тогда
			// Параметр Бюджет не должен быть доступен в настройках СКД.
			ПараметрСКД = СКД.Параметры.Добавить();
			ПараметрСКД.Имя                      = "Бюджет";
			ПараметрСКД.Заголовок                = НСтр("ru='Бюджет';en='Budget'");
			ПараметрСКД.ТипЗначения              = Новый ОписаниеТипов("СправочникСсылка.бит_Бюджеты");
			ПараметрСКД.ВключатьВДоступныеПоля   = Ложь;
			ПараметрСКД.ОграничениеИспользования = Истина;
			ПараметрСКД.Значение                 = Бюджет;
		КонецЕсли; 
		
		// Заполняем поля набора.
		УстановитьЗаголовкиПолей(СКД);		
		
		АдресКомпоновки = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
		
		// Инициализируем компоновщик
		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресКомпоновки);
		Попытка
			Компоновщик.Инициализировать(ИсточникНастроек);
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось инициализировать компоновщик для отбора. Попробуйте обновить текст запроса. Описание ошибки: %1.';
								  |en='Failed to initialize builder for selection. Try refreshing the query text. Description of error:%1.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения);
		КонецПопытки;
		
		Компоновщик.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
		
		Если СохраненныеОтборы.Количество() > 0 Тогда
			ЗаполнитьОтборы(СохраненныеОтборы, Компоновщик.Настройки.Отбор.Элементы);
			Компоновщик.Восстановить();
		КонецЕсли;
		Если СохраненныйПорядок.Количество() > 0 Тогда
			ЗаполнитьПорядок(СохраненныйПорядок, Компоновщик.Настройки.Порядок.Элементы);
			Компоновщик.Восстановить();
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат АдресКомпоновки;
	
КонецФункции // ИнициализироватьКомпоновщик()

// Процедура формирует текст сортировки и добавляет его к тексту запроса.
//
// Параметры:
//  ТекстЗапроса	 - Строка - Исходный текст запроса.
//  НастройкаСхемы	 - НастройкиКомпоновкиДанных - Настройка компоновки данных. 
//  БюджетЗаполнен	 - Булево - Признак заполнения бюджета.
//
Процедура ДобавитьТекстСортировки(ТекстЗапроса, НастройкаСхемы, БюджетЗаполнен) Экспорт
		
	НастройкаСхемыИзХранилища = НастройкаСхемы.Получить();
	Если НастройкаСхемыИзХранилища <> Неопределено 
		И НастройкаСхемыИзХранилища.Количество() > 0 И НастройкаСхемыИзХранилища.Свойство("НастройкиКомпоновщика") Тогда
		// Удалить участок сортировки, если он есть.
		МестоУдалить = Найти(ТекстЗапроса, "УПОРЯДОЧИТЬ ПО");
		Если МестоУдалить <> 0 Тогда			
			ТекстЗапроса = Лев(ТекстЗапроса, МестоУдалить-1);	
		КонецЕсли;
		// Удалить участок удаления таблиц, если он есть.
		МестоУничтожить = Найти(ТекстЗапроса, "УНИЧТОЖИТЬ");
		Если МестоУничтожить <> 0 Тогда			
			МестоУдалить = СтрНайти(ТекстЗапроса, ";", НаправлениеПоиска.СКонца, МестоУничтожить);
			Если МестоУдалить <> 0 Тогда
				ТекстЗапроса = Лев(ТекстЗапроса, МестоУдалить-1);	
			КонецЕсли;	
		КонецЕсли;
		ПорядокСохраненный = НастройкаСхемыИзХранилища.НастройкиКомпоновщика.Порядок.Элементы;
		// Добавление текста сортировки в запрос.
		ТекстСортировки = "";
		Для каждого ЭлементПорядок Из ПорядокСохраненный Цикл
			Если НЕ ЭлементПорядок.Использование Тогда
				Продолжить;	
			КонецЕсли;
			Если ПустаяСтрока(ТекстСортировки) Тогда
				ТекстСортировки = "УПОРЯДОЧИТЬ ПО" + Символы.ПС;
			Иначе
				ТекстСортировки = ТекстСортировки + "," + Символы.ПС;
			КонецЕсли;
			ТекстСортировки = ТекстСортировки + "ВременнаяТаблица." + Строка(ЭлементПорядок.Поле);
			Если ЭлементПорядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв Тогда
				ТекстСортировки = ТекстСортировки + " УБЫВ";		
			КонецЕсли;
		КонецЦикла;
		Если НЕ ПустаяСтрока(ТекстСортировки) Тогда
			Если БюджетЗаполнен Тогда		
				ТекстСортировки = СтрЗаменить(ТекстСортировки, "ВременнаяТаблица.СтатьяБюджета", "СтатьиБюджета.СтатьяБюджета");
				ТекстСортировки = СтрЗаменить(ТекстСортировки, "ВременнаяТаблица.СтатьяОборотов", "СтатьиБюджета.СтатьяОборотов");
			Иначе
				ТекстСортировки = СтрЗаменить(ТекстСортировки, "ВременнаяТаблица.СтатьяОборотов", "СтатьиОборотов.СтатьяОборотов");
			КонецЕсли;
			ТекстЗапроса = ТекстЗапроса  + Символы.ПС + ТекстСортировки;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // СформироватьТекстЗапросаПоСтатьямОборотов()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьЗаголовкиПолей(СКД)
	
	НастройкиИзмерений = ОбщегоНазначения.СкопироватьРекурсивно(
						бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
	
	// Дополним "пустышками" неиспользуемые аналитики.
	ВГраница = ?(бит_ОбщегоНазначения.ЭтоСемействоБП(), 7, 12);
	Для Индекс = 1 По ВГраница Цикл
		ТекущаяНастройка = НастройкиИзмерений.Получить("Аналитика_" + Индекс);
		Если НастройкиИзмерений.Получить("Аналитика_" + Индекс) = Неопределено Тогда
			НастройкиИзмерений.Вставить("Аналитика_" + Индекс, Неопределено);
		КонецЕсли; 
	КонецЦикла; 
	
	ПоляВыбора = СКД.НастройкиПоУмолчанию.Выбор.Элементы;
	ПоляНабора = СКД.НаборыДанных[СКД.НаборыДанных.Количество() - 1].Поля;
		
	Для каждого Поле Из ПоляВыбора Цикл
		Если СтрНачинаетсяС(Строка(Поле.Поле), "Аналитика") Тогда
			ТекущаяНастройка = НастройкиИзмерений.Получить(Строка(Поле.Поле));
			НовоеПоле = ПоляНабора.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			НовоеПоле.Поле = Строка(Поле.Поле);
			НовоеПоле.ПутьКДанным = Строка(Поле.Поле);
			
			Если ТекущаяНастройка = Неопределено Тогда
				НовоеПоле.ОграничениеИспользования.Группировка = Истина;
				НовоеПоле.ОграничениеИспользования.Поле 	  = Истина;
				НовоеПоле.ОграничениеИспользования.Порядок 	  = Истина;
				НовоеПоле.ОграничениеИспользования.Условие 	  = Истина;
				НовоеПоле.ОграничениеИспользованияРеквизитов.Группировка  = Истина;
				НовоеПоле.ОграничениеИспользованияРеквизитов.Поле 	  	  = Истина;
				НовоеПоле.ОграничениеИспользованияРеквизитов.Порядок 	  = Истина;
				НовоеПоле.ОграничениеИспользованияРеквизитов.Условие 	  = Истина;
			Иначе	
				Поле.Заголовок 	= ТекущаяНастройка.Синоним;
				НовоеПоле.Заголовок = ТекущаяНастройка.Синоним;
				НовоеПоле.ТипЗначения = ТекущаяНастройка.ТипЗначения;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры

Процедура ЗаполнитьОтборы(НаборИсточник, НаборПриемник)

	Для каждого ЭлементИсточник Из НаборИсточник Цикл
		ЭлементПриемник = НаборПриемник.Добавить(Тип(ЭлементИсточник));
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		Если ТипЗнч(ЭлементИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ЗаполнитьОтборы(ЭлементИсточник.Элементы, ЭлементПриемник.Элементы);
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры
 
Процедура ЗаполнитьПорядок(НаборИсточник, НаборПриемник)

	Для каждого ЭлементИсточник Из НаборИсточник Цикл
		ЭлементПриемник = НаборПриемник.Добавить(Тип(ЭлементИсточник));
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник); 
	КонецЦикла; 

КонецПроцедуры
 
#КонецОбласти

#КонецЕсли
